{
  "protocol_type": "nutrition",
  "title": "Nutrition",
  "interventions": [
    {
      "name": "Uncategorized Foods",
      "number": 1,
      "action": "START",
      "scientific_rationale": "This diverse group of foods provides key nutrients to address your current biomarker needs. Beans, lentils, and soy-based foods supply plant protein and iron, supporting healthy hemoglobin and energy levels, while also helping to lower LDL cholesterol and Apo B. Fatty fish like mackerel and sardines are rich in omega-3s, which can improve LDL particle size and reduce inflammation. Nuts, seeds, and olive oil offer healthy fats and antioxidants that support hormone balance and cardiovascular health. Colorful fruits and vegetables like cranberries, apples, broccoli, and cabbage provide fiber and phytonutrients that help regulate cholesterol, support immune defenses, and maintain gut and urinary tract health. Together, these foods create a foundation for balanced hormones, improved blood markers, and sustained energy.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "2"
        },
        {
          "Field": "Description",
          "Details": "Aim to include a variety of beans, lentils, whole grains, nuts, seeds, and colorful vegetables in your meals each day. Start your morning with Greek yogurt and fruit, enjoy a bean or lentil-based salad or stir fry for lunch, and add fish like mackerel or sardines to dinner 1-2 times per week. Rotate potatoes, yams, and whole grains like quinoa and brown rice as your main carbohydrate sources, and use olive oil for cooking or dressings."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Support heart, hormone, and energy health with nutrient-rich whole foods."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Include",
          "Value": "Mackerel, Sardines, Greek yogurt, Lentils, Black bean, Chickpeas, Soybeans, Edamame, Tofu, Kidney beans, Quinoa, Brown rice, Potatoes, Yam, Sweet potatoes, Broccoli, Cauliflower, Cabbage, Lettuce, Bananas, Apples, Cranberries, Hazelnuts, Pistachios, Sunflower seeds, Flaxseeds, Olive oil, Pork, Corn, Cassava"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "Leptin",
          "Status": "BELOW_REF_RANGE"
        },
        {
          "Biomarker": "LDL Particle Size",
          "Status": "BELOW_REF_RANGE"
        },
        {
          "Biomarker": "Albumin",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Progesterone",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Total Cholesterol",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Apolipoprotein B",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Ferritin",
          "Status": "BELOW_REF_RANGE"
        },
        {
          "Biomarker": "LDL Particle Concentration",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Small LDL Particle Concentration",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Urinary Bacteria",
          "Status": "ABNORMAL"
        },
        {
          "Biomarker": "LDL Cholesterol",
          "Status": "ABOVE_REF_RANGE"
        }
      ],
      "ranking": 2
    },
    {
      "name": "Urinary Health & Bacteria Reduction",
      "number": 2,
      "action": "START",
      "scientific_rationale": "Whole cranberries and bearberries contain compounds like proanthocyanidins and arbutin, which prevent bacteria from attaching to the urinary tract lining, reducing infection risk. Oranges and peaches provide vitamin C and hydration, which support immune defenses and help dilute urine, making it less hospitable to bacteria. Live culture yogurt introduces beneficial probiotics that help maintain healthy urinary and vaginal flora, further lowering bacterial overgrowth. Garlic offers natural antimicrobial properties, while nettle leaves act as a gentle diuretic, increasing urine flow and helping flush out bacteria, all of which can help lower squamous epithelial cells and reduce UTI risk, especially important after recent childbirth.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "5"
        },
        {
          "Field": "Description",
          "Details": "Aim to include at least one urinary health-supporting food or beverage at each meal. Start your day with a glass of water and a serving of fruit like oranges or peaches, add live culture yogurt as a snack or breakfast option, and incorporate garlic or nettle leaves into lunch or dinner recipes. Drink water consistently throughout the day to help flush your urinary tract."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Lower urinary bacteria to reduce UTIs and support bladder health."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Include",
          "Value": "Whole cranberries, Bearberries, Live culture yogurt, Garlic, Nettle leaves, Oranges, Peaches, Water"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "Urinary Bacteria",
          "Status": "ABNORMAL"
        },
        {
          "Biomarker": "Urinary Squamous Epithelial Cells",
          "Status": "ABOVE_REF_RANGE"
        }
      ],
      "ranking": 5
    },
    {
      "name": "Iron & Red Blood Cell Enhancement",
      "number": 3,
      "action": "START",
      "scientific_rationale": "Combining heme iron sources like chicken thigh and salmon with vitamin C-rich foods such as gold kiwifruit and guava helps increase your ferritin and MCHC levels by improving both iron intake and absorption. Vitamin C from kiwifruit, guava, and lemon-dressed spinach salad converts plant-based (non-heme) iron from mung beans and spinach into a more absorbable form, directly supporting red blood cell production. Heme iron from chicken and salmon is efficiently absorbed and helps replenish iron stores, which is especially important for women with heavier menstrual bleeding. These foods work together to optimize oxygen transport, energy levels, and hormone function by supporting healthy hemoglobin and red blood cell indices.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "6"
        },
        {
          "Field": "Description",
          "Details": "Aim to include at least one iron-rich food at each meal. Start your day with vitamin C-rich fruits like gold kiwifruit or guava to enhance iron absorption, add chicken thigh or salmon to lunch or dinner for heme iron, and enjoy a lemon-dressed spinach salad or mung beans as a side or in salads. Pair plant-based iron sources with vitamin C foods to maximize absorption and aim for variety throughout the week."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Boosts iron and red blood cells to support your energy and hormone balance."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Include",
          "Value": "Chicken thigh, Salmon, Guava, Gold kiwifruit, Lemon-dressed spinach salad, Mung beans, Kiwifruit"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "Ferritin",
          "Status": "BELOW_REF_RANGE"
        },
        {
          "Biomarker": "Mean Corpuscular Hemoglobin Concentration",
          "Status": "BELOW_REF_RANGE"
        }
      ],
      "ranking": 6
    },
    {
      "name": "Hormone & Energy Regulation",
      "number": 4,
      "action": "START",
      "scientific_rationale": "Leafy greens like kale, spinach, and Swiss chard are rich in fiber and phytonutrients that help regulate estrogen and progesterone by promoting healthy SHBG levels and supporting liver detoxification of hormones. Cruciferous vegetables such as Brussels sprouts and arugula provide compounds like indole-3-carbinol, which aid in hormone metabolism and may lower excess estrogen activity. Soy foods (tofu, tempeh, edamame, unsweetened soy milk) contain phytoestrogens that gently balance hormone fluctuations, especially after pregnancy, and help stabilize leptin and prolactin. Berries and cucumbers are low-calorie, high-antioxidant foods that support energy metabolism and help manage cholesterol, while also providing vitamin C to support iron absorption and blood health.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "6"
        },
        {
          "Field": "Description",
          "Details": "Aim to include at least one leafy green and one soy-based food in your meals each day—add spinach or kale to breakfast smoothies, enjoy a tofu or edamame salad at lunch, and fill half your dinner plate with steamed Brussels sprouts or Swiss chard. Snack on berries or cucumbers for fiber and antioxidants, and rotate different greens and berries throughout the week to maximize nutrient variety. Try to have at least 2 servings of leafy greens and 1 serving of soy foods daily for optimal hormone support."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Supports hormone balance and energy for better mood and vitality."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Include",
          "Value": "Spinach, Kale, Brussels sprouts, Swiss chard, Arugula, Silken tofu, Low-protein tempeh, Steamed edamame, Unsweetened soy milk, Blueberries, Blackberries, Raspberries, Strawberries, Cucumbers"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "Progesterone",
          "Status": "ABOVE_REF_RANGE"
        }
      ],
      "ranking": 6
    },
    {
      "name": "Cholesterol & Lipid Improvement",
      "number": 5,
      "action": "START",
      "scientific_rationale": "Soluble fiber from oats, barley, beans, and psyllium husk binds cholesterol in your gut, reducing its absorption and lowering LDL cholesterol and ApoB levels. Chia seeds and walnuts provide omega-3 fatty acids, which help decrease small, dense LDL particles and inflammation. Almonds and extra virgin olive oil are rich in monounsaturated fats and plant sterols, which replace saturated fats and further lower LDL and non-HDL cholesterol. Avocado offers both fiber and healthy fats, supporting improved lipid profiles and reducing cardiovascular risk. These foods together target multiple cholesterol markers, helping to lower LDL particle number, small LDL, and ApoB, which are key drivers of heart disease risk.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "10"
        },
        {
          "Field": "Description",
          "Details": "Aim to include at least one cholesterol-lowering food at every meal. Start your day with oats or barley as a base for breakfast, add beans or black beans to salads or soups at lunch, and use chia seeds or psyllium husk in smoothies or yogurt snacks. Snack on a small handful of almonds or walnuts, and use extra virgin olive oil and avocado as healthy fat sources in your cooking or as toppings."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Lowers LDL and ApoB to protect your heart and blood vessels."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Include",
          "Value": "Oats, Barley, Psyllium husk, Beans, Black beans, Chia seeds, Walnuts, Almonds, Extra virgin olive oil, Avocado"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "LDL Particle Concentration",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Non-HDL Cholesterol",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Apolipoprotein B",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Small LDL Particles",
          "Status": "ABOVE_REF_RANGE"
        }
      ],
      "ranking": 10
    },
    {
      "name": "Avoid Cholesterol Raising & Inflammatory Foods",
      "number": 6,
      "action": "AVOID",
      "scientific_rationale": "Foods high in saturated fats (like butter, fatty beef, and processed meats) and trans fats (such as margarine and shortening) raise LDL cholesterol, increase ApoB, and promote the formation of small, dense LDL particles, all of which drive cardiovascular risk. Added sugars and refined grains (found in soda, candy, pastries, and white bread) spike blood sugar and insulin, fueling inflammation and worsening lipid profiles. Processed and fried foods often contain both unhealthy fats and sugars, amplifying their negative impact on cholesterol, leptin, and inflammatory markers. By avoiding these foods, you help lower LDL particle number, reduce inflammation, and support healthier hormone and iron status, directly addressing your out-of-range biomarkers.",
      "details": [
        {
          "Field": "-------",
          "Details": "------"
        },
        {
          "Field": "Ranking",
          "Details": "999"
        },
        {
          "Field": "Description",
          "Details": "Limit foods high in saturated fat, trans fat, and added sugar by choosing home-cooked meals over processed or fast foods. Swap out butter, fatty meats, and packaged snacks for lean proteins, whole grains, and fresh produce. Read labels to avoid hidden sources of unhealthy fats and sugars, and aim to prepare most meals at home to stay in control of your ingredients."
        },
        {
          "Field": "Benefit Summary",
          "Details": "Lowering these foods protects your heart, hormones, and long-term health."
        }
      ],
      "parameters": [
        {
          "Field": "-------",
          "Value": "-------"
        },
        {
          "Field": "Type",
          "Value": "NUTRITION"
        },
        {
          "Field": "Foods to Avoid",
          "Value": "Butter, Tallow, Palm oil, Margarine sticks, Shortening, Cream, Fatty beef, Fatty beef cuts, Ribeye, Ribeye steak, Fatty pork cuts, Pork belly, Pork shoulder, Bacon, Processed meats (e.g., hot dogs, sausage, salami), Ultraprocessed Meats, Sausage, Hot dogs, Salami, Bologna, Sheep fat, Lamb chops, Fatty lamb cuts, Lamb shoulder, Table sugar, Honey, Soda, Energy drinks, Sweetened iced tea, Sports drinks, Candy, Pastries, Donuts, Cakes, Cookies, Packaged baked goods, French fries, Potato chips, Cheese puffs, Pretzels, Fried mozzarella sticks, Onion rings, Frozen pizza, Hot pockets, Instant noodles, Fast food burgers, Fried chicken, Flavored coffee creamers, Cornflakes, White bread, Refined pasta, Sugary cereals, Cheddar cheese, Cheese"
        }
      ],
      "target_biomarkers": [
        {
          "Biomarker": "-----------",
          "Status": "--------"
        },
        {
          "Biomarker": "LDL Cholesterol",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "LDL Particle Concentration",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Apolipoprotein B",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Non-HDL Cholesterol",
          "Status": "ABOVE_REF_RANGE"
        },
        {
          "Biomarker": "Small LDL Particles",
          "Status": "ABOVE_REF_RANGE"
        }
      ],
      "ranking": 999
    }
  ],
  "total_interventions": 6
}